---
kind: method
id: M:Autodesk.Revit.DB.UpdaterData.Dispose
source: html/6ad46f9b-e128-d03a-c017-d5ed70d4438a.htm
---
# Autodesk.Revit.DB.UpdaterData.Dispose Method

Releases all resources used by the UpdaterData

## Syntax (C#)
```csharp
public void Dispose()
```